# GetFootprintBoundary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLanding..::..GetFootprintBoundary Method
StairsLanding Class See Also
---
Returns the landing's boundary curves which are projected on the stairs base level.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CurveLoop GetFootprintBoundary()
```

Visual Basic
---
```text
Public Function GetFootprintBoundary As CurveLoop
```

Visual C++
---
```text
public:
CurveLoop^ GetFootprintBoundary()
```

# ### Return Value
The boundary curves of the landing.
# See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace